ИТ_Фирма/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количественный</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	
	Если СортироватьПоВозрастанию = Ложь Тогда
		СортироватьПоВозрастанию = Истина;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВнизКрасная;	
		Объект.Товары.Сортировать("Сумма Убыв");	
	ИначеЕсли СортироватьПоВозрастанию = Истина Тогда
		СортироватьПоВозрастанию = Ложь;
		Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ФормаСортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаВверхЗеленая;	
		Объект.Товары.Сортировать("Сумма");  
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком",ПараметрыОткрытия,Элементы.Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		
		Возврат; 
		
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		
		Если ВыбраннаяНоменклатура.Количество() = 0 Тогда
			
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
			
		Иначе
			
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока. Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
			НайденнаяСтрока.Сумма =  НайденнаяСтрока.Цена * НайденнаяСтрока.Количество;	
		КонецЕсли;
		
	КонецЦикла;	
		
	
	
КонецПроцедуры

#Область ОбратботкаИзменений
&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	//Установка цены
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		 ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		ИзмененнаяСтрока.Цена = 0;
	КонецЕсли;
	
	//УстановкиСкидки
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли;
	
	//Установка ставка НДС
	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		ИзмененнаяСтрока.СтавкаНДС = ЦеныВызовСервера.СтавкаНДСНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииСкидки(ИзмененнаяСтрока);
	ПриИЗмененииСтавкиНДС(ИзмененнаяСтрока);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	РасчетСуммыСтроки(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
 КонецПроцедуры	
  
&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)

	 РасчетСуммыСтроки(ИзмененнаяСтрока);
	 ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)

	 РасчетСуммыСтроки(ИзмененнаяСтрока);
	 ПриИзмененииСуммы(ИзмененнаяСтрока); 
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)

	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	 
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)

	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	 
КонецПроцедуры	

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные; 
	
	ПриИзмененииСуммы(ТекДанные);
	РасчетМаксимальногоКоличества(ТекДанные);
	РасчетСуммыСтроки(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммыСтроки(ИзмененнаяСтрока)

	Если ИзмененнаяСтрока = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;	  
    ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена * (1 - ИзмененнаяСтрока.Скидка / 100);

КонецПроцедуры

&НаКлиенте
Процедура РасчетМаксимальногоКоличества(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Цена = 0 Тогда 	
		Сообщить(СтрШаблон("Не указана цена для  %1", ИзмененнаяСтрока.Номенклатура));
		Возврат;	
	Иначе	
		ИзмененнаяСтрока.Количество = Окр(Формат(ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Цена,"ЧДЦ=2"),0,РежимОкругления.Окр15как10);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Интерфейс 

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииНоменклатуры(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииКоличества(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииЦены(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииСкидки(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ПриИзмененииСтавкиНДС(ТекДанные);

КонецПроцедуры
#КонецОбласти
